cfe llm/Catalogs/AI_ПрофилиДоступаКДанным.xml
<?xml version="1.0" encoding="utf-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_ПрофилиДоступаКДанным</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РазрешитьВыполнениеЗапросов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумШагов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумЗапросовКДанным</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумСтрокРезультата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяДлинаЗапроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазрешенныеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолноеИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребоватьПериод</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОграниченныеПоля</Name>
					<Comment>Поля, которые агенту запрещено использовать в запросах. Пустой список разрешает все поля разрешенных объектов.</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/Catalogs/AI_ПрофилиДоступаКДанным/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)

	Если МаксимумШагов = 0 Тогда
		МаксимумШагов = 6;
	КонецЕсли;
	Если МаксимумЗапросовКДанным = 0 Тогда
		МаксимумЗапросовКДанным = 4;
	КонецЕсли;
	Если МаксимумСтрокРезультата = 0 Тогда
		МаксимумСтрокРезультата = 100;
	КонецЕсли;
	Если МаксимальнаяДлинаЗапроса = 0 Тогда
		МаксимальнаяДлинаЗапроса = 10000;
	КонецЕсли;

	Если МаксимумШагов < 0 Тогда
		ВызватьИсключение "Максимум шагов не может быть отрицательным.";
	КонецЕсли;
	Если МаксимумЗапросовКДанным < 0 Тогда
		ВызватьИсключение "Максимум запросов к данным не может быть отрицательным.";
	КонецЕсли;
	Если МаксимумСтрокРезультата < 0 Тогда
		ВызватьИсключение "Максимум строк результата не может быть отрицательным.";
	КонецЕсли;
	Если МаксимальнаяДлинаЗапроса < 0 Тогда
		ВызватьИсключение "Максимальная длина запроса не может быть отрицательной.";
	КонецЕсли;

	БелыйСписок = Новый Соответствие;
	Для Каждого СтрокаОбъекта Из РазрешенныеОбъекты Цикл
		СтрокаОбъекта.ПолноеИмя = СокрЛП(СтрокаОбъекта.ПолноеИмя);
		Если Не ЗначениеЗаполнено(СтрокаОбъекта.ПолноеИмя) Тогда
			ВызватьИсключение "В белом списке обнаружена строка без полного имени объекта.";
		КонецЕсли;
		Ключ = НРег(СтрокаОбъекта.ПолноеИмя);
		Если БелыйСписок.Получить(Ключ) <> Неопределено Тогда
			ВызватьИсключение "Объект повторяется в белом списке: " + СтрокаОбъекта.ПолноеИмя;
		КонецЕсли;
		Если AI_МетаданныеСервер.ПолучитьОбъектМетаданных(СтрокаОбъекта.ПолноеИмя) = Неопределено Тогда
			ВызватьИсключение "Объект метаданных не найден: " + СтрокаОбъекта.ПолноеИмя;
		КонецЕсли;
		БелыйСписок.Вставить(Ключ, Истина);
	КонецЦикла;

	Если РазрешитьВыполнениеЗапросов И БелыйСписок.Количество() = 0 Тогда
		ВызватьИсключение "Для выполнения запросов заполните белый список объектов.";
	КонецЕсли;

	Ограничения = Новый Соответствие;
	Для Каждого СтрокаПоля Из ОграниченныеПоля Цикл
		СтрокаПоля.ПолноеИмяОбъекта = СокрЛП(СтрокаПоля.ПолноеИмяОбъекта);
		СтрокаПоля.ИмяПоля = СокрЛП(СтрокаПоля.ИмяПоля);
		Если Не ЗначениеЗаполнено(СтрокаПоля.ПолноеИмяОбъекта)
				Или Не ЗначениеЗаполнено(СтрокаПоля.ИмяПоля) Тогда
			ВызватьИсключение "В ограничениях полей заполните объект и имя поля.";
		КонецЕсли;
		Если БелыйСписок.Получить(НРег(СтрокаПоля.ПолноеИмяОбъекта)) = Неопределено Тогда
			ВызватьИсключение "Ограничение поля задано для объекта вне белого списка: "
				+ СтрокаПоля.ПолноеИмяОбъекта;
		КонецЕсли;
		Ключ = НРег(СтрокаПоля.ПолноеИмяОбъекта + "." + СтрокаПоля.ИмяПоля);
		Если Ограничения.Получить(Ключ) <> Неопределено Тогда
			ВызватьИсключение "Ограничение поля повторяется: " + Ключ;
		КонецЕсли;
		Ограничения.Вставить(Ключ, Истина);
	КонецЦикла;

КонецПроцедуры
